In [14]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'],axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [20]:
target=df.Survived  #separating the target variable
inputs= df.drop('Survived', axis='columns')

In [22]:
dummies= pd.get_dummies(inputs.Sex) #converting the sex column into a dummy variable as python can't handle text
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [23]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [24]:
inputs.drop('Sex', axis='columns', inplace= True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [25]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [26]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [28]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [69]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test= train_test_split(inputs,target,test_size=0.2)

In [70]:
len(x_train)

712

In [71]:
len(x_test)

179

In [72]:
len(inputs)

891

In [73]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [74]:
model.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [75]:
model.score(x_test,y_test)

0.8100558659217877

In [76]:
x_test[:10]

     Pclass        Age     Fare  female  male
223       3  29.699118   7.8958       0     1
711       1  29.699118  26.5500       0     1
872       1  33.000000   5.0000       0     1
789       1  46.000000  79.2000       0     1
553       3  22.000000   7.2250       0     1
91        3  20.000000   7.8542       0     1
790       3  29.699118   7.7500       0     1
84        2  17.000000  10.5000       1     0
451       3  29.699118  19.9667       0     1
402       3  21.000000   9.8250       1     0

In [77]:
y_test[:10]

223    0
711    0
872    0
789    0
553    1
91     0
790    0
84     1
451    0
402    0
Name: Survived, dtype: int64

In [78]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1], dtype=int64)

In [79]:
model.predict_proba(x_test[:10])

array([[0.9881079 , 0.0118921 ],
       [0.89248287, 0.10751713],
       [0.89932838, 0.10067162],
       [0.64662383, 0.35337617],
       [0.98637516, 0.01362484],
       [0.98581713, 0.01418287],
       [0.98809975, 0.01190025],
       [0.02164819, 0.97835181],
       [0.98810009, 0.01189991],
       [0.05135974, 0.94864026]])